import { GalleryItemTypes } from "./type";

export const GALLERY_ITEMS: GalleryItemTypes[] = [
  {
    id: "topic-card",
    label: "랜덤 주제 카드 🎴",
    title: "랜덤 주제 카드",
    desc: "매일 새롭게 주어지는 ‘주제 카드’를 통해 대화를 시작하세요. “요즘 가장 위로가 되었던 일은?” 같은 질문이 자연스럽게 마음을 열게 합니다.",
    imageSrc: "/images/mock2.png",
  },
  {
    id: "category-card",
    label: "다양한 주제 확인 🎯",
    title: "다양한 주제 확인",
    desc: "감정, 경험, 취미, 일상 등 다양한 카테고리를 탐색할 수 있어요. 주제별로 깊이 있는 대화를 나누며 진정성 있는 소통을 즐길 수 있어요.",
    imageSrc: "/images/mock3.png",
  },
  {
    id: "empathy",
    label: "대화 연결 💬",
    title: "공감이 닿으면, 대화가 시작돼요",
    desc: "단순한 좋아요가 아니라, 진짜 공감으로 연결됩니다. 서로의 이야기에 마음이 닿을 때 1:1로 이어져 더 깊은 대화가 시작됩니다.",
    imageSrc: "/images/mock4.png",
  },
  // {
  //   id: "anonymity",
  //   label: "익명 속 진정성 🫶",
  //   title: "하나의 스토리가 되는 프로필",
  //   desc: "소람은 외모나 스펙보다 내면의 대화를 중요시합니다. 최소한의 프로필로, 진짜 나로서 연결해보세요.",
  //   imageSrc: "/images/mock5.png",
  // },
];

// ▶ 랜덤 주제

// - 매일 소람이 추천하는 다양한 주제 중 하나로 쉽게 이야기를 시작할 수 있어요.
// - 새로운 주제를 통해 매번 색다른 이야기를 경험해보세요.

// ▶ 카테고리별 주제 확인

// - 관심 있는 주제를 선택해 나와 비슷한 취향과 관심사를 가진 인연을 찾을 수 있어요
// - 감정, 경험, 취미, 일상 등 다양한 카테고리를 탐색할 수 있어요.
// - 주제별로 깊이 있는 대화를 나누며 진정성 있는 소통을 즐길 수 있어요.

// ▶ 대화 연결

// - 마음에 드는 상대방의 이야기에 대화를 요청하면 1:1 대화방으로 자연스럽게 이어져요.
// - 대화 요청 기능으로 마음이 맞는 사람과 진정성 있는 소통 가능.
// - 최초 무료 제공 후 선택적 충전으로 꾸준히 소통할 수 있어요.

// ▶ 하나의 스토리가 되는 프로필

// - 이야기 중심의 프로필로 나를 표현할 수 있어요.
// - 외모나 스펙 대신 경험과 감정을 통해 연결되는 프로필.
